docs/posts/2010-10-05-religious-knowledge-survey.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 27, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Religious Knowledge Survey</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Religious Knowledge Survey</h1>
<p class="subtitle" role="doc-subtitle">Oct 05, 2010</p>
</header><p>
<a href="http://www.ethicsdaily.com">EthicsDaily.com</a> has an interesting story about a recent Pew Forum survey on religious knowledge in the United States. Jews, Mormons, and atheists/agnostics appear to know more about world religions than American Christians.
</p>

<p>
For those who would like to test their own knowledge, the Pew Forum on Religion and Public Life has provided a <a href="http://features.pewforum.org/quiz/us-religious-knowledge/">short version of the survey</a> that you can take online.
</p>


<div class="tagline" id="org8f915d0">
<p>
Tagged: <a href="../tags/religion.html">Religion</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 27, 2024.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
